nc: 80  # <--- change to your number of classes

depth_multiple: 1.0
width_multiple: 1.0

scales:
  - [10,13, 16,30, 33,23]      # P3/8
  - [30,61, 62,45, 59,119]     # P4/16
  - [116,90, 156,198, 373,326] # P5/32

backbone:
  [
    [-1, 1, Conv, [64, 3, 2]],         # 0 - P1/2
    [-1, 1, Conv, [128, 3, 2]],        # 1 - P2/4
    [-1, 3, C2f, [128]],               # 2
    [-1, 1, Conv, [256, 3, 2]],        # 3 - P3/8
    [-1, 9, C2f, [256]],               # 4
    [-1, 1, Conv, [512, 3, 2]],        # 5 - P4/16
    [-1, 9, C2f, [512]],               # 6
    [-1, 1, Conv, [1024, 3, 2]],       # 7 - P5/32
    [-1, 3, C2f, [1024]],              # 8
    [-1, 1, SPPF, [1024, 5]],          # 9
  ]

head:
  [
    [-1, 1, Conv, [512, 1, 1]],                # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 11
    [[-1, 6], 1, Concat, [1]],                 # 12
    [-1, 3, C2f, [512]],                       # 13

    [-1, 1, Conv, [256, 1, 1]],                # 14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 15
    [[-1, 4], 1, Concat, [1]],                 # 16
    [-1, 3, C2f, [256]],                       # 17

    [-1, 1, Conv, [256, 3, 2]],                # 18
    [[-1, 13], 1, Concat, [1]],                # 19
    [-1, 3, C2f, [512]],                       # 20

    [-1, 1, Conv, [512, 3, 2]],                # 21
    [[-1, 9], 1, Concat, [1]],                 # 22
    [-1, 3, C2f, [1024]],                      # 23

    [[17, 20, 23], 1, Detect, [nc]]            # 24 - Detect(P3, P4, P5)
  ]
